app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "プログラミング学習"], ["body", "プログラミング学習"], ["created_at", "2021-10-10 08:43:22.186741"], ["updated_at", "2021-10-10 08:43:22.186741"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "プログラミング学習\r\n追記：編集機能をつくりました"], ["updated_at", "2021-10-10 10:04:42.019877"], ["id", 1]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    list = List.find(params[:id])
    list.destroy